In [15]:
# importing numpy and pandas
import numpy as np
import pandas as pd

In [16]:
# importing timesheet
timesheet = pd.read_excel("timesheet.xlsx",sheet_name="time")
timesheet.head()

        Name     emp id   In time  Out time  max late max early
0   Abhishek     TIA009  11:00:00  20:30:00  11:10:00  20:20:00
1      Aditi     TIA019  10:00:00  18:30:00  10:10:00  18:20:00
2    Santosh     TIA028  09:00:00  18:00:00  09:10:00  17:50:00
3  Bantubala  Bantubala  11:30:00  15:00:00  11:40:00  14:50:00
4    Purnima     TIA024  10:00:00  18:30:00  10:10:00  18:20:00

In [3]:
# creating a dict of employee name with there id 
name_id = timesheet[["Name","emp id"]].set_index("Name").to_dict()['emp id']
print(name_id)

{'Abhishek': 'TIA009', 'Aditi': 'TIA019', 'Santosh': 'TIA028', 'Bantubala': 'Bantubala', 'Purnima': 'TIA024', 'Kuldeep': 'TIA013', 'Sachin': 'TIA012', 'Saheba': 'TIA004', 'Diksha': 'TIA027', 'Varun': 'Varun', 'Arvind': 'TIA026', 'Devesh': 'TIA023', 'Dev': 'Dev', 'Ajay': 'TIA011', 'Sakshee': 'Sakshee', 'Mahak': 'Mahak'}

In [4]:
# importing leave data - you can just copy and past the leave request data from google sheets directly to the leave sheet as it is
leave_data = pd.read_excel("leave_data.xlsx",sheet_name='leave')

# selecting only necessory column
leave_data =  leave_data[['Name','Leave Start Date','Leave End Date','Half Day/ Full Day?','Number of Days']]

# creating first name column
leave_data['first name'] = leave_data.apply(lambda x: x["Name"].split(' ')[0].strip(),axis=1)
leave_data.head()

,Name,Leave Start Date,Leave End Date,Half Day/ Full Day?,Number of Days,first name
0,Anjali Bohra,2022-03-21 00:00:00,2022-03-21 00:00:00,Full day,1.0,Anjali
1,Devendra Patidar,2022-03-24 00:00:00,2022-03-26 00:00:00,Full day,3.0,Devendra
2,Saheba Khan,2022-03-26 00:00:00,2022-03-26 00:00:00,Full day,1.0,Saheba
3,Saheba Khan,2022-03-29 00:00:00,2022-03-29 00:00:00,Full day,1.0,Saheba
4,Saheba Khan,2022-03-31 00:00:00,2022-03-31 00:00:00,Full day,1.0,Saheba

In [5]:
leave_data.head()

,Name,Leave Start Date,Leave End Date,Half Day/ Full Day?,Number of Days,first name
0,Anjali Bohra,2022-03-21 00:00:00,2022-03-21 00:00:00,Full day,1.0,Anjali
1,Devendra Patidar,2022-03-24 00:00:00,2022-03-26 00:00:00,Full day,3.0,Devendra
2,Saheba Khan,2022-03-26 00:00:00,2022-03-26 00:00:00,Full day,1.0,Saheba
3,Saheba Khan,2022-03-29 00:00:00,2022-03-29 00:00:00,Full day,1.0,Saheba
4,Saheba Khan,2022-03-31 00:00:00,2022-03-31 00:00:00,Full day,1.0,Saheba

In [6]:
leave_data['emp id'] = leave_data['first name'].apply(lambda x: name_id.get(x,x))
leave_data.to_excel("leaves.xlsx",index=False)

In [7]:
# user id with there name data import and fix
# first working on user id data
user_data = open("user.dat","r").read()

# messy data in this file
print("messy data in this file\n",user_data[:800])
print("\n\ncleaned data ---> \n")
# the file contain non ACSII and symboles that we dont need we are only keeping the data with numbers and char
a = ""
for i in user_data:
    if i.isalnum():
        a += i
    else:
        a += " "
a = a.split()

# variable a contain a list of name,id,name,id,name,id so we need 2 list name and id 
name = [a[i] for i in range(len(a)) if i%2==0]
user_id = [int(a[i]) for i in range(len(a)) if i%2==1]
print("name- ",name)
print("User id -",user_id)
for i in range(len(name)):
    if name[i]=='Bantu':
        name[i] = "Bantubala"
# now converting this 2 list into one dictionary with id as key and name as value
user = dict(zip(user_id,name))
# print("Updated data in a dict",user)

# converting that dictionary to data frame
user_df = pd.DataFrame(user.values(),index=user.keys())
user_df.reset_index(inplace=True)
user_df.rename(columns={0:"Name","index":"id"},inplace=True)
user_df['emp id'] = user_df['Name'].apply(lambda x: name_id.get(x,np.nan))

# our work has done we get the data of users in this variable
user_df

messy data in this file
           Saheba                              1                                 Lokesh                              2                                Hemant                              3                                Abhishek                            4                                 Kuldeep                             5                       	         Sachin                              9                       
         Varun                               10                                Priya                               11                                Bantubala                           12                      
          Saloni                              13                                Priyanka                            14                             


cleaned data --->

name-  ['Saheba', 'Lokesh', 'Hemant', 'Abhishek', 'Kuldeep', 'Sachin', 'Varun', 'Priya', 'Bantubala', 'Saloni', 'Priyanka', 'Govind', 'Purvi', 'Moiz', 'Gayatri', 'Shivangi', 'Aditi', 'Vaishali', 'Swarna', 'Devesh', 'Purnima', 'Arvind', 'Diksha', 'Santosh', 'Mahak', 'Sakshee']
User id - [1, 2, 3, 4, 5, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 6]

    id       Name     emp id
0    1     Saheba     TIA004
1    2     Lokesh        NaN
2    3     Hemant        NaN
3    4   Abhishek     TIA009
4    5    Kuldeep     TIA013
5    9     Sachin     TIA012
6   10      Varun      Varun
7   11      Priya        NaN
8   12  Bantubala  Bantubala
9   13     Saloni        NaN
10  14   Priyanka        NaN
11  15     Govind        NaN
12  16      Purvi        NaN
13  17       Moiz        NaN
14  18    Gayatri        NaN
15  19   Shivangi        NaN
16  20      Aditi     TIA019
17  21   Vaishali        NaN
18  22     Swarna        NaN
19  23     Devesh     TIA023
20  24    Purnima     TIA024
21  25     Arvind     TIA026
22  26     Diksha     TIA027
23  27    Santosh     TIA028
24  28      Mahak      Mahak
25   6    Sakshee    Sakshee

In [8]:
# this is the main file which has the attendance data and reading it in csv
df = pd.read_csv("attendance.dat",header=None)

# because the data is in one column spliting it and keeping only the req. two columns so make these function that extract the data in first two columns

def get_id(text):
    return text.split("\t")[0]
def get_time(text):
    return text.split("\t")[1]

# creating two columns ID and punch_Time that hold the data when the employee punch in and out

df["id"]= df[0].map(get_id)
df["punch_time"] = df[0].map(get_time)
df.drop(columns=[0],inplace=True)   # deleting the raw data column and keeping only two column
df['id']= df["id"].astype(int)      # conerting id column to int

df.head()

   id           punch_time
0  23  2025-04-01 09:17:01
1  25  2025-04-01 09:25:18
2  28  2025-04-01 09:57:22
3  24  2025-04-01 09:59:49
4   1  2025-04-01 10:50:40

In [9]:
# merge the data of id and punch time data into one data frame
data = pd.merge(df,user_df,how="left",on="id")

In [10]:
# Combined data
data.head()

   id           punch_time     Name  emp id
0  23  2025-04-01 09:17:01   Devesh  TIA023
1  25  2025-04-01 09:25:18   Arvind  TIA026
2  28  2025-04-01 09:57:22    Mahak   Mahak
3  24  2025-04-01 09:59:49  Purnima  TIA024
4   1  2025-04-01 10:50:40   Saheba  TIA004

In [11]:
# extracting date and time 

data['datetime'] = pd.to_datetime(df['punch_time'])
data['date'] = pd.to_datetime(df['punch_time']).dt.date
data['in_out_time'] = pd.to_datetime(df['punch_time']).dt.time
data["am_pm"] = data['datetime'].dt.strftime("%p")
data.drop(columns="punch_time",inplace=True)     # no use of this column now
data.head()

   id     Name  emp id            datetime        date in_out_time am_pm
0  23   Devesh  TIA023 2025-04-01 09:17:01  2025-04-01    09:17:01    AM
1  25   Arvind  TIA026 2025-04-01 09:25:18  2025-04-01    09:25:18    AM
2  28    Mahak   Mahak 2025-04-01 09:57:22  2025-04-01    09:57:22    AM
3  24  Purnima  TIA024 2025-04-01 09:59:49  2025-04-01    09:59:49    AM
4   1   Saheba  TIA004 2025-04-01 10:50:40  2025-04-01    10:50:40    AM

In [12]:
# merge time data to main dataframe

data = pd.merge(data,timesheet,how="left",on ='Name')
data.head()

,id,Name,emp id_x,datetime,date,in_out_time,am_pm,emp id_y,In time,Out time,max late,max early
0,23,Devesh,TIA023,2025-04-01 09:17:01,2025-04-01,09:17:01,AM,TIA023,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
1,25,Arvind,TIA026,2025-04-01 09:25:18,2025-04-01,09:25:18,AM,TIA026,2025-01-07 09:30:00,2025-01-07 18:00:00,2025-01-07 09:40:00,2025-01-07 17:50:00
2,28,Mahak,Mahak,2025-04-01 09:57:22,2025-04-01,09:57:22,AM,Mahak,2025-01-07 10:00:00,2025-01-07 17:00:00,2025-01-07 10:10:00,2025-01-07 17:50:00
3,24,Purnima,TIA024,2025-04-01 09:59:49,2025-04-01,09:59:49,AM,TIA024,2025-01-07 10:00:00,2025-01-07 18:30:00,2025-01-07 10:10:00,2025-01-07 18:20:00
4,1,Saheba,TIA004,2025-04-01 10:50:40,2025-04-01,10:50:40,AM,TIA004,2025-01-07 11:00:00,2025-01-07 18:30:00,2025-01-07 11:10:00,2025-01-07 18:20:00

In [13]:
# data.to_excel("main_data.xlsx",index=False)

In [14]:
# appending the data which we clean to the all data file

filedf = pd.read_excel("main_data.xlsx")
filedf = pd.concat((filedf,data))
filedf = filedf.drop_duplicates()
filedf.to_excel("main_data.xlsx",index=False)